mafeiGitHub/stm32Mp3/src/main.cpp
// main.cpp
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdint.h>
#include <math.h>

#include "memory.h"
#include "cmsis_os.h"

#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "ipv4/lwip/ip_addr.h"
#include "lwip/api.h"
#include "os/ethernetif.h"

#include "cHttp.h"
#include "../httpServer/httpServer.h"
#include "../httpServer/ftpServer.h"

#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_msc.h"

#ifdef STM32F746G_DISCO
  #include "stm32746g_discovery.h"
  #include "stm32746g_discovery_ts.h"
  #include "stm32746g_discovery_audio.h"
  #include "stm32746g_discovery_sd.h"
#else
  #include "stm32f769i_discovery.h"
  #include "stm32f769i_discovery_ts.h"
  #include "stm32f769i_discovery_audio.h"
  #include "stm32f769i_discovery_sd.h"
#endif

#include "../fatfs/fatFs.h"

#include "decoders/cMp3decoder.h"
#include "../aac/neaacdec.h"

#include "cLcd.h"
#include "widgets/cRootContainer.h"
#include "widgets/cWidget.h"
#include "widgets/cListWidget.h"
#include "widgets/cTextBox.h"
#include "widgets/cValueBox.h"
#include "widgets/cSelectValueBox.h"
#include "widgets/cWaveWidget.h"
#include "widgets/cWaveCentreWidget.h"
#include "widgets/cWaveLensWidget.h"
//}}}
USBD_HandleTypeDef USBD_Device;

#define SD_BLK_SIZ 512
static const uint32_t sdReadCacheSize = 0x40;
static uint8_t* mSdReadCache;
static uint32_t mSdReadCacheBlock = 0xFFFFFFB0;
static uint32_t sdReads = 0;
static uint32_t sdReadHits = 0;
static uint32_t sdReadMultipleLen = 0;
static uint32_t sdReadBlock = 0xFFFFFFFF;

static uint32_t sdWrites = 0;
static uint32_t sdWriteMultipleLen = 0;
static uint32_t sdWriteBlock = 0xFFFFFFFF;
//{{{
static int8_t SD_IsReady (uint8_t lun) {
  return ((BSP_SD_IsDetected() != SD_NOT_PRESENT) && (BSP_SD_GetStatus() == SD_TRANSFER_OK)) ? 0 : -1;
  }
//}}}
//{{{
static int8_t SD_GetCapacity (uint8_t lun, uint32_t* block_num, uint16_t* block_size) {

  if (BSP_SD_IsDetected() != SD_NOT_PRESENT) {
    HAL_SD_CardInfoTypedef info;
    BSP_SD_GetCardInfo (&info);
    *block_num = (info.CardCapacity) / SD_BLK_SIZ - 1;
    *block_size = SD_BLK_SIZ;
    return 0;
    }

  return -1;
  }
//}}}
//{{{
static int8_t SD_Read (uint8_t lun, uint8_t* buf, uint32_t blk_addr, uint16_t blk_len) {

  if (BSP_SD_IsDetected() != SD_NOT_PRESENT) {
    //BSP_SD_ReadBlocks_DMA ((uint32_t*)buf, blk_addr * SD_BLK_SIZ, SD_BLK_SIZ, blk_len);
    //SCB_InvalidateDCache_by_Addr ((uint32_t*)((uint32_t)buf & 0xFFFFFFE0), (blk_len * SD_BLK_SIZ) + 32);

    if ((blk_addr >= mSdReadCacheBlock) && (blk_addr + blk_len <= mSdReadCacheBlock + sdReadCacheSize)) {
      sdReadHits++;
      memcpy (buf, mSdReadCache + ((blk_addr - mSdReadCacheBlock) * SD_BLK_SIZ), blk_len * SD_BLK_SIZ);
      }
    else {
      sdReads++;
      BSP_SD_ReadBlocks_DMA ((uint32_t*)mSdReadCache, blk_addr * SD_BLK_SIZ, SD_BLK_SIZ, sdReadCacheSize);
      SCB_InvalidateDCache_by_Addr ((uint32_t*)((uint32_t)mSdReadCache & 0xFFFFFFE0), (sdReadCacheSize * SD_BLK_SIZ) + 32);
      memcpy (buf, mSdReadCache, blk_len * SD_BLK_SIZ);
      mSdReadCacheBlock = blk_addr;
      }

    //cLcd::debug ("r:" + cLcd::dec (blk_addr) + "::" + cLcd::dec (blk_len));
    if (blk_addr != sdReadBlock + sdReadMultipleLen) {
      if (sdReadMultipleLen) {
        // flush pending multiple
        cLcd::debug ("rm:" + cLcd::dec (sdReadBlock) + "::" + cLcd::dec (sdReadMultipleLen));
        sdReadMultipleLen = 0;
        }
      sdReadBlock = blk_addr;
      }
    sdReadMultipleLen += blk_len;

    return 0;
    }

  return -1;
  }
//}}}
//{{{
static int8_t SD_Write (uint8_t lun, uint8_t* buf, uint32_t blk_addr, uint16_t blk_len) {

  if (BSP_SD_IsDetected() != SD_NOT_PRESENT) {
    sdWrites++;
    BSP_SD_WriteBlocks_DMA ((uint32_t*)buf, blk_addr * SD_BLK_SIZ, SD_BLK_SIZ, blk_len);
    mSdReadCacheBlock = 0xFFFFFFF0;

    //cLcd::debug ("w " + cLcd::dec (blk_addr) + " " + cLcd::dec (blk_len));
    if (blk_addr != sdWriteBlock + sdWriteMultipleLen) {
      if (sdWriteMultipleLen) {
        // flush pending multiple
        cLcd::debug ("wm:" + cLcd::dec (sdWriteBlock) + "::" + cLcd::dec (sdWriteMultipleLen));
        sdWriteMultipleLen = 0;
        }
      sdWriteBlock = blk_addr;
      }
    sdWriteMultipleLen += blk_len;

    return 0;
    }

  return -1;
  }
//}}}
//{{{
static const uint8_t SD_Inquirydata[] = {
  0x00, // LUN 0
  0x80, 0x02, 0x02,
  (24 - 5),
  0x00, 0x00, 0x00,
  'C', 'o', 'l', 'i', 'n', ' ', ' ', ' ',                                         // Manufacturer: 8 bytes
  'S', 'D', ' ', 'd', 'i', 's', 'k', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', // Product     : 16 Bytes
  '0', '.', '9','9',                                                              // Version     : 4 Bytes
  };
//}}}

//{{{
static const USBD_StorageTypeDef USBD_DISK_fops = {
  SD_GetCapacity,
  SD_IsReady,
  SD_Read,
  SD_Write,
  (int8_t*)SD_Inquirydata,
  };
//}}}

//{{{
class cHlsChan {
public:
  cHlsChan() {}
  virtual ~cHlsChan() {}

  // gets
  int getChan() { return mChan; }
  int getSampleRate() { return kSampleRate; }
  int getSamplesPerFrame() { return kSamplesPerFrame; }
  int getFramesPerChunk() { return kFramesPerChunk; }
  int getFramesFromSec (int sec) { return int (sec * getFramesPerSecond()); }
  float getFramesPerSecond() { return (float)kSampleRate / (float)kSamplesPerFrame; }

  int getLowBitrate() { return 48000; }
  int getMidBitrate() { return 128000; }
  int getHighBitrate() { return 320000; }

  int getBaseSeqNum() { return mBaseSeqNum; }

  std::string getHost() { return mHost; }
  std::string getTsPath (int seqNum, int bitrate) { return getPathRoot (bitrate) + '-' + toString (seqNum) + ".ts"; }
  std::string getChanName (int chan) { return kChanNames [chan]; }
  std::string getDateTime() { return mDateTime; }
  std::string getChanInfoStr() { return mChanInfoStr; }

  // set
  //{{{
  void setChan (cHttp& http, int chan) {

    mChan = chan;
    mHost = "as-hls-uk-live.bbcfmt.vo.llnwd.net";

    #ifdef STM32F769I_DISCO
      BSP_LED_On (LED2);
    #endif

    cLcd::debug (mHost);
    if (http.get (mHost, getM3u8path()) == 302) {
      mHost = http.getRedirectedHost();
      http.get (mHost, getM3u8path());
      cLcd::debug (mHost);
      }
    else
      mHost = http.getRedirectedHost();
    cLcd::debug (getM3u8path());

    #ifdef STM32F769I_DISCO
      BSP_LED_Off (LED2);
    #endif

    // find #EXT-X-MEDIA-SEQUENCE in .m3u8, point to seqNum string, extract seqNum from playListBuf
    auto extSeq = strstr ((char*)http.getContent(), "#EXT-X-MEDIA-SEQUENCE:") + strlen ("#EXT-X-MEDIA-SEQUENCE:");
    auto extSeqEnd = strchr (extSeq, '\n');
    *extSeqEnd = '\0';
    mBaseSeqNum = atoi (extSeq) + 3;

    auto extDateTime = strstr (extSeqEnd + 1, "#EXT-X-PROGRAM-DATE-TIME:") + strlen ("#EXT-X-PROGRAM-DATE-TIME:");
    auto extDateTimeEnd = strchr (extDateTime, '\n');
    *extDateTimeEnd = '\0';
    mDateTime = extDateTime;

    mChanInfoStr = toString (http.getResponse()) + ' ' + http.getInfoStr() + ' ' + getM3u8path() + ' ' + mDateTime;
    cLcd::debug (mDateTime + " " + cLcd::dec (mBaseSeqNum));
    }
  //}}}

