mafeiGitHub/stm32Mp3/src/main.cpp
private:
  //{{{  const
  const int kSampleRate = 48000;
  const int kSamplesPerFrame = 1024;
  const int kFramesPerChunk = 300;

  const int kPool        [7] = {      0,      7,      7,      7,      6,      6,      6 };
  const char* kChanNames [7] = { "none", "radio1", "radio2", "radio3", "radio4", "radio5", "radio6" };
  const char* kPathNames [7] = { "none", "bbc_radio_one", "bbc_radio_two", "bbc_radio_three",
                                         "bbc_radio_fourfm", "bbc_radio_five_live", "bbc_6music" };
  //}}}
  //{{{
  std::string getPathRoot (int bitrate) {
    return "pool_" + toString (kPool[mChan]) + "/live/" + kPathNames[mChan] + '/' + kPathNames[mChan] +
           ".isml/" + kPathNames[mChan] + "-audio=" + toString (bitrate);
    }
  //}}}
  std::string getM3u8path () { return getPathRoot (getMidBitrate()) + ".norewind.m3u8"; }

  // vars
  int mChan = 0;
  int mBaseSeqNum = 0;
  std::string mHost;
  std::string mDateTime;
  std::string mChanInfoStr;
  };
//}}}
//{{{
class cHlsChunk {
public:
  //{{{
  cHlsChunk() {
    mAudio = (int16_t*)pvPortMalloc (300 * 1024 * 2 * 2);
    mPower = (uint8_t*)malloc (300 * 2);
    }
  //}}}
  //{{{
  ~cHlsChunk() {
    NeAACDecClose (mDecoder);
    if (mPower)
      free (mPower);
    if (mAudio)
      vPortFree (mAudio);
    }
  //}}}

  // gets
  int getSeqNum() { return mSeqNum; }
  int getBitrate() { return mBitrate; }
  int getFramesLoaded() { return mFramesLoaded; }
  std::string getInfoStr() { return mInfoStr; }

  int16_t* getSamples (int frameInChunk) { return (mAudio + (frameInChunk * mSamplesPerFrame * 2)); }
  //{{{
  uint8_t* getPower (int frameInChunk, int& frames) {
    frames = getFramesLoaded() - frameInChunk;
    return mPower + (frameInChunk * 2);
    }
  //}}}

  //{{{
  bool load (cHttp& http, cHlsChan* hlsChan, int seqNum, int bitrate) {

    auto ok = true;
    BSP_LED_On (LED1);

    mFramesLoaded = 0;
    mSeqNum = seqNum;
    mBitrate = bitrate;

    auto response = http.get (hlsChan->getHost(), hlsChan->getTsPath (seqNum, mBitrate));
    if (response == 200) {
      // aacHE has double size frames, treat as two normal frames
      int framesPerAacFrame = mBitrate <= 48000 ? 2 : 1;
      mSamplesPerFrame = hlsChan->getSamplesPerFrame();
      int samplesPerAacFrame = mSamplesPerFrame * framesPerAacFrame;

      auto loadPtr = http.getContent();
      auto loadEnd = http.getContentEnd();
      loadEnd = packTsBuffer (loadPtr, loadEnd);

      int16_t* buffer = mAudio;

      if (!mDecoder) {
        //{{{  create, init aac decoder
        mDecoder = NeAACDecOpen();

        NeAACDecConfiguration* config = NeAACDecGetCurrentConfiguration (mDecoder);
        config->outputFormat = FAAD_FMT_16BIT;
        NeAACDecSetConfiguration (mDecoder, config);

        unsigned long sampleRate;
        uint8_t chans;
        NeAACDecInit (mDecoder, loadPtr, 2048, &sampleRate, &chans);

        NeAACDecFrameInfo frameInfo;
        NeAACDecDecode2 (mDecoder, &frameInfo, loadPtr, 2048, (void**)(&buffer), samplesPerAacFrame * 2 * 2);
        }
        //}}}

      uint8_t* powerPtr = mPower;
      while (loadPtr < loadEnd) {
        NeAACDecFrameInfo frameInfo;
        NeAACDecDecode2 (mDecoder, &frameInfo, loadPtr, 2048, (void**)(&buffer), samplesPerAacFrame * 2 * 2);
        loadPtr += frameInfo.bytesconsumed;
        for (int i = 0; i < framesPerAacFrame; i++) {
          //{{{  calc left, right power
          int valueL = 0;
          int valueR = 0;
          for (int j = 0; j < mSamplesPerFrame; j++) {
            short sample = (*buffer++) >> 4;
            valueL += sample * sample;
            sample = (*buffer++) >> 4;
            valueR += sample * sample;
            }

          uint8_t leftPix = (uint8_t)sqrt(valueL / (mSamplesPerFrame * 32.0f));
          *powerPtr++ = (272/2) - leftPix;
          *powerPtr++ = leftPix + (uint8_t)sqrt(valueR / (mSamplesPerFrame * 32.0f));
          mFramesLoaded++;
          }
          //}}}
        }

      http.freeContent();
      mInfoStr = "ok " + toString (seqNum) + ':' + toString (bitrate/1000) + 'k';
      }
    else {
      mSeqNum = 0;
      mInfoStr = toString (response) + ':' + toString (seqNum) + ':' + toString (bitrate/1000) + "k " + http.getInfoStr();
      ok = false;

      }

    BSP_LED_Off (LED1);
    return ok;
    }
  //}}}
  //{{{
  void invalidate() {
    mSeqNum = 0;
    mFramesLoaded = 0;
    }
  //}}}

private:
  //{{{
  uint8_t* packTsBuffer (uint8_t* ptr, uint8_t* endPtr) {
  // pack transportStream to aac frames in same buffer

    auto toPtr = ptr;
    while ((ptr < endPtr) && (*ptr++ == 0x47)) {
      auto payStart = *ptr & 0x40;
      auto pid = ((*ptr & 0x1F) << 8) | *(ptr+1);
      auto headerBytes = (*(ptr+2) & 0x20) ? (4 + *(ptr+3)) : 3;
      ptr += headerBytes;
      auto tsFrameBytesLeft = 187 - headerBytes;
      if (pid == 34) {
        if (payStart && !(*ptr) && !(*(ptr+1)) && (*(ptr+2) == 1) && (*(ptr+3) == 0xC0)) {
          int pesHeaderBytes = 9 + *(ptr+8);
          ptr += pesHeaderBytes;
          tsFrameBytesLeft -= pesHeaderBytes;
          }
        memcpy (toPtr, ptr, tsFrameBytesLeft);
        toPtr += tsFrameBytesLeft;
        }
      ptr += tsFrameBytesLeft;
      }

    return toPtr;
    }
  //}}}

  // vars
  NeAACDecHandle mDecoder = 0;
  int16_t* mAudio = nullptr;
  uint8_t* mPower = nullptr;

  int mSeqNum = 0;
  int mBitrate = 0;
  int mFramesLoaded = 0;
  int mSamplesPerFrame = 0;
  std::string mInfoStr;
  };
//}}}
//{{{
class cHlsLoader : public cHlsChan {
public:
  cHlsLoader() {}
  virtual ~cHlsLoader() {}

  int getBitrate() { return mBitrate; }
  int getLoading() { return mLoading; }
  //{{{
  std::string getInfoStr (int frame) {
    return getChanName (getChan()) + ':' + toString (getBitrate()/1000) + "k " + getFrameInfo (frame);
    }
  //}}}
  //{{{
  std::string getFrameInfo (int frame) {

    int secsSinceMidnight = int (frame / getFramesPerSecond());
    int secs = secsSinceMidnight % 60;
    int mins = (secsSinceMidnight / 60) % 60;
    int hours = secsSinceMidnight / (60*60);

