mafeiGitHub/stm32Mp3/src/main.cpp
    return toString (hours) + ':' + toString (mins) + ':' + toString (secs);
    }
  //}}}
  //{{{
  std::string getChunkInfoStr (int chunk) {
    return getChunkNumStr (chunk) + ':' + mChunks[chunk].getInfoStr();
    }
  //}}}
  //{{{
  uint8_t* getPower (int frame, int& frames) {
  // return pointer to frame power org,len uint8_t pairs
  // frames = number of valid frames

    int seqNum;
    int chunk = 0;
    int frameInChunk;
    frames = 0;
    return findFrame (frame, seqNum, chunk, frameInChunk) ? mChunks[chunk].getPower (frameInChunk, frames) : nullptr;
    }
  //}}}
  //{{{
  int16_t* getSamples (int frame, int& seqNum) {
  // return audio buffer for frame

    int chunk;
    int frameInChunk;
    return findFrame (frame, seqNum, chunk, frameInChunk) ? mChunks[chunk].getSamples (frameInChunk) : nullptr;
    }
  //}}}

  //{{{
  int changeChan (int chan) {

    setChan (mHttp, chan);
    mBitrate = getMidBitrate();

    int hour = ((getDateTime()[11] - '0') * 10) + (getDateTime()[12] - '0');
    int min =  ((getDateTime()[14] - '0') * 10) + (getDateTime()[15] - '0');
    int sec =  ((getDateTime()[17] - '0') * 10) + (getDateTime()[18] - '0');
    int secsSinceMidnight = (hour * 60 * 60) + (min * 60) + sec;
    mBaseFrame = getFramesFromSec (secsSinceMidnight);

    invalidateChunks();
    return mBaseFrame;
    }
  //}}}
  void setBitrate (int bitrate) { mBitrate = bitrate; }

  //{{{
  bool load (int frame) {
  // return false if any load failed

    bool ok = true;

    mLoading = 0;
    int chunk;
    int seqNum = getSeqNumFromFrame (frame);

    if (!findSeqNumChunk (seqNum, mBitrate, 0, chunk)) {
      // load required chunk
      mLoading++;
      ok &= mChunks[chunk].load (mHttp, this, seqNum, mBitrate);
      }

    if (!findSeqNumChunk (seqNum, mBitrate, 1, chunk)) {
      // load chunk before
      mLoading++;
      ok &= mChunks[chunk].load (mHttp, this, seqNum+1, mBitrate);
      }

    if (!findSeqNumChunk (seqNum, mBitrate, -1, chunk)) {
      // load chunk after
      mLoading++;
      ok &= mChunks[chunk].load (mHttp, this, seqNum-1, mBitrate);
      }
    mLoading = 0;

    return ok;
    }
  //}}}

private:
  //{{{
  int getSeqNumFromFrame (int frame) {
  // works for -ve frame

    int r = frame - mBaseFrame;
    if (r >= 0)
      return getBaseSeqNum() + (r / getFramesPerChunk());
    else
      return getBaseSeqNum() - 1 - ((-r-1)/ getFramesPerChunk());
    }
  //}}}
  //{{{
  int getFrameInChunkFromFrame (int frame) {
  // works for -ve frame

    int r = (frame - mBaseFrame) % getFramesPerChunk();
    return r < 0 ? r + getFramesPerChunk() : r;
    }
  //}}}
  //{{{
  std::string getChunkNumStr (int chunk) {
    return mChunks[chunk].getSeqNum() ? toString (mChunks[chunk].getSeqNum() - getBaseSeqNum()) : "*";
    }
  //}}}

  //{{{
  bool findFrame (int frame, int& seqNum, int& chunk, int& frameInChunk) {
  // return true, seqNum, chunk and frameInChunk of loadedChunk from frame
  // - return false if not found

    auto findSeqNum = getSeqNumFromFrame (frame);
    for (auto i = 0; i < 3; i++) {
      if ((mChunks[i].getSeqNum() != 0) && (findSeqNum == mChunks[i].getSeqNum())) {
        auto findFrameInChunk = getFrameInChunkFromFrame (frame);
        if ((mChunks[i].getFramesLoaded() > 0) && (findFrameInChunk < mChunks[i].getFramesLoaded())) {
          seqNum = findSeqNum;
          chunk = i;
          frameInChunk = findFrameInChunk;
          return true;
          }
        }
      }

    seqNum = 0;
    chunk = 0;
    frameInChunk = 0;
    return false;
    }
  //}}}
  //{{{
  bool findSeqNumChunk (int seqNum, int bitrate, int offset, int& chunk) {
  // return true if match found
  // - if not, chunk = best reuse
  // - reuse same seqNum chunk if diff bitrate ?

    // look for matching chunk
    chunk = 0;
    while (chunk < 3) {
      if (seqNum + offset == mChunks[chunk].getSeqNum())
        return true;
        //return bitrate != mChunks[chunk].getBitrate();
      chunk++;
      }

    // look for stale chunk
    chunk = 0;
    while (chunk < 3) {
      if ((mChunks[chunk].getSeqNum() < seqNum-1) || (mChunks[chunk].getSeqNum() > seqNum+1))
        return false;
      chunk++;
      }

    chunk = 0;
    return false;
    }
  //}}}
  //{{{
  void invalidateChunks() {
    for (auto i = 0; i < 3; i++)
      mChunks[i].invalidate();
    }
  //}}}

  // private vars
  cHttp mHttp;
  cHlsChunk mChunks[3];
  int mBaseFrame = 0;
  int mBitrate = 0;
  int mLoading = 0;
  std::string mInfoStr;
  };
//}}}

//{{{  static vars
static osSemaphoreId mAudSem;
static bool mAudHalf = false;

static float mVolume = 0.7f;
static int mIntVolume = 0;
static bool mVolumeChanged = false;

static int mPlayFrame = 0;

// ui
static cLcd* mLcd = nullptr;
static cRootContainer* mRoot = nullptr;

// mp3
static int fileIndex = 0;
static bool fileIndexChanged = false;
static std::vector<std::string> mMp3Files;

static bool mWaveLoad = false;
static bool mWaveChanged = false;
static int mWaveLoadFrame = 0;
static uint8_t* mWave = nullptr;
static int* mFrameOffsets = nullptr;

// hls
static int mTuneChan = 4;
static bool mTuneChanChanged = false;
static cHlsLoader* mHlsLoader;
static osSemaphoreId mHlsLoaderSem;
static std::string mInfoStr;
//}}}
//{{{  audio callback
//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {
  mAudHalf = true;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {
  mAudHalf = false;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//}}}

//{{{
class cPowerWidget : public cWidget {
public:
  cPowerWidget (cHlsLoader* hlsLoader, uint16_t width, uint16_t height) :
    cWidget (COL_BLUE, width, height), mHlsLoader(hlsLoader) {}
  virtual ~cPowerWidget() {}

  virtual void render (iDraw* draw) {
    int frame = mPlayFrame - mWidth/2;
    int frames = 0;
    uint8_t* power = nullptr;
    for (auto x = 0; x < mWidth; x++, frame++) {
      if (frames <= 0)
        power = mHlsLoader->getPower (frame, frames);
      if (power) {
        uint8_t top = *power++;
        uint8_t ylen = *power++;
        draw->rectClipped (COL_BLUE, x, top, 1, ylen);
        frames--;
        }
      }
    }
private:
  cHlsLoader* mHlsLoader;
  };
//}}}
//{{{
class cInfoTextBox : public cWidget {
public:
  cInfoTextBox (uint16_t width) : cWidget (width) {}
  virtual ~cInfoTextBox() {}

